## **1. Penjelasan Proyek**

Sebagai tugas akhir mata kuliah Database Sains Data, kelompok kami mengembangkan database **Sistem Pemesanan Tiket Bioskop Online**. Kami memilih topik tersebut karena selain adanya familiaritas akan proses pemesanan tiket bioskop dan minat untuk menyelidiknya lebih dalam, topik ini berguna untuk menangani permasalahan yang dihadapi ketika membeli tiket bioskop ketika dilakukan manual. Antrean yang berkepanjangan memakan waktu lama, pengunjung kesusahan memilih tempat duduk sesuai dengan keinginannya menimbulkan ketidaknyamanan, serta yang lebih parah, kehabisan *seat* :(

<center><img src="CGV-Raya-Padang.jpg" width="500" height="100"><center>


Karena itu, dibutuhkan sebuah sistem yang memudahkan pengunjung untuk melakukan proses pemesanan tiket bioskop, yaitu sistem online dengan menggunakan teknologi berbasis internet sehingga pengunjung dapat membayar tiket tanpa harus mengantri. Pengunjung dapat melihat film yang akan ditayangkan di bioskop, mendapatkan informasi harga tiket pada bioskop yang berbeda lokasinya, mendapatkan informasi ketersediaan tiket dan lokasi tempat duduk, dan membeli tiket bioskop yang ingin ditontonnya melalui internet. Kode booking yang diperoleh pada saat pengunjung selesai melakukan transaksi digunakan sebagai bukti pembayaran yang sah dan kode tersebut akan digunakan sebagai tiket masuk.

### **Software yang Digunakan**
1. Draw.io: untuk berkolaborasi dalam mengembangkan diagram-diagram
2. DB Browser for SQLite: untuk melihat dan mengedit rancangan database yang telah dibuat
3. Jupyter Notebook: untuk menyusun database menggunakan modul SQLite3

## **2. Perancangan Database Awal**

### **Entity Relationship Diagram (ERD)**

Sebagai tahap awal dalam merancang sebuah database, kita perlu melihat struktur serta hubungan/relasi antar entitas serta atributnya (kolom dan data) Berikut ERD yang telah kami kembangkan

<center ><img src="ERD.png" width="700" height="440"> <center>

Agar tidak terlalu panjang pada notebook, kita akan memperjelas 3 entitas.

#### Entitas Pelanggan
Entitas pelanggan memiliki atribut id_pelanggan (primary key), nama, jenis kelamin, alamat, no_HP, dan email. 

Setiap pelanggan dapat melakukan lebih dari satu pemesanan tiket bioskop sementara setiap pemesanan hanya dapat dilakukan oleh satu pelanggan. Oleh karena itu, hubungan antara entitas pelanggan dan pemesanan adalah **one-to-many.**

Selain itu, setiap pelanggan tidak harus melakukan pemesanan tiket bioskop dan pemesanan tidak harus dilakukan oleh pelanggan. Dengan demikian, jenis participation constraint yang digunakan adalah **partial participation.** 

#### Entitas Tiket
Entitas tiket memiliki atribut id_tiket (primary key), id_jadwal (foreign key), nama_kursi (foreign key), dan harga. Perhatikan bahwa atribut harga merupakan *multivalued-atribute* karena harga tiket bioskop bersifat variatif. 

Setiap tiket memiliki satu jadwal, namun setiap jadwal dapat dimiliki oleh lebih dari satu tiket. Oleh karena itu, hubungan antara entitas tiket dan jadwal adalah **many-to-one.** 

Selain itu, setiap tiket pasti akan memiliki jadwal, namun setiap jadwal film belum tentu memiliki tiket. Dengan demikian, jenis participation constraint yang digunakan adalah **partial participation.**

#### Entitas Kursi
Entitas kursi memiliki atribut nama_kursi sebagai primary key dan kode studio sebagai foreign key. 

Satu tiket hanya memperoleh satu kursi dan satu kursi diperoleh satu tiket, sehingga entitas tiket dan entitas kursi memiliki **one to one relationship.**

Perhatikan bahwa tiap tiket pasti memperoleh kursi sehingga jenis participation constraint disini adalah **total participation.**

### **Tabel Relasional**

Model Data Relasional (Tabel Relasional) menunjukan cara mengelola data, yang berdampak pada bagaimana kita mengelompokan data dan membentuk keseluruhan database. Berikut adalah tabel relasional yang telah kami buat

<center><img src="Relasional.png" width="500" height="440"> <center>

Agar tidak terlalu panjang, kita akan memperjelas 3 tabel.

#### Tabel pelanggan
Tabel pelanggan memiliki atribut/kolom id_pelanggan (INT) sebagai **primary key**, nama (VARCHAR(50)), jenis kelamin VARCHAR(10)), alamat (VARCHAR(100)), no_HP (INT), dan email (VARCHAR(50)). Atribut id_pelanggan (primary key) juga menghubungkan ke tabel pemesanan sebagai **foreign key** dengan hubungan **one-to-many.**

#### Tabel tiket
Tabel tiket memiliki atribut/kolom id_tiket (INT) sebagai **primary key**, harga (FLOAT), id_jadwal (INT) sebagai **foreign key** yang menghubungkan tabel tiket ke tabel jadwal dengan hubungan many-to-one, nama_kursi (VARCHAR(10)) sebagai **foreign key** yang menghubungkan tabel kursi ke tabel tiket, dan kode_film (INT) sebagai **foreign key** yang menghubungkan tabel film ke tabel pemesanan. Atribut id_tiket (primary_key) juga menghubungkan ke tabel pemesanan sebagai foreign key.

#### Tabel kursi
Tabel kursi memiliki atribut/kolom nama_kursi (VARCHAR(10)) sebagai **primary key** dan kode_studio (INT) sebagai **foreign key** yang menghubungkan tabel kursi dengan tabel studio.

## **3. Pembuatan Database**

### **Menghubungkan Jupyter Notebook dengan DB Browser**

Sebelum membuat tabel, kita perlu  menghubungkan Notebook kita dengan DB Browser melalui package sqlite3

In [23]:
import sqlite3
MyDB = sqlite3.connect('bioskop1.sqlite')
cursor = MyDB.cursor()

### **Create Table**
Pada tahap ini, akan dibentuk terlebih dahulu tabel-tabel sesuai dengan ERD yang telah kami buat. Total tabel yang kami buat adalah 8 tabel, yaitu: PELANGGAN, PEMESANAN, STUDIO, TIKET, GENRE, JADWAL, KURSI, dan FILM.

In [24]:
#MEMBUAT TABLE

#TABLE PELANGGAN
MyDB = sqlite3.connect('bioskop1.sqlite')
cursor = MyDB.cursor()
cursor.execute('''CREATE TABLE PELANGGAN
         (ID_PELANGGAN INT PRIMARY KEY NOT NULL,
         NAMA VARCHAR(50) ,
         JENIS_KELAMIN VARCHAR(10) ,
         ALAMAT VARCHAR(100) ,
         NO_HP INT, 
         EMAIL VARCHAR(50));''')

#TABLE PEMESANAN
cursor.execute('''CREATE TABLE PEMESANAN
         (ID_PEMESANAN INT PRIMARY KEY NOT NULL,
         JUMLAH_TIKET INT,
         TOTAL_HARGA FLOAT,
         TANGGAL_PEMESANAN DATE,
         ID_TIKET INT,
         ID_PELANGGAN INT);''')

#TABLE STUDIO
cursor.execute('''CREATE TABLE STUDIO
         (KODE_STUDIO INT PRIMARY KEY NOT NULL,
         NAMA_STUDIO INT,
         KODE_FILM INT);''')

#TABLE JADWAL
cursor.execute('''CREATE TABLE JADWAL
         (ID_JADWAL INT PRIMARY KEY NOT NULL,
         TANGGAL DATE,
         JAM_MULAI TIME,
         JAM_SELESAI TIME);''')

#TABLE TIKET
cursor.execute('''CREATE TABLE TIKET
         (ID_TIKET INT PRIMARY KEY NOT NULL,
         HARGA FLOAT,
         ID_JADWAL INT,
         KODE_FILM INT,
         NAMA_KURSI VARCHAR(10));''')

#TABLE KURSI
cursor.execute('''CREATE TABLE KURSI
         (NAMA_KURSI VARCHAR(10) PRIMARY KEY NOT NULL,
         KODE_STUDIO INT);''')

#TABLE GENRE
cursor.execute('''CREATE TABLE GENRE
         (KODE_GENRE INT PRIMARY KEY NOT NULL,
         NAMA_GENRE VARCHAR(20));''')

#TABLE FILM
cursor.execute('''CREATE TABLE FILM
         (KODE_FILM INT PRIMARY KEY NOT NULL,
         JUDUL VARCHAR(50),
         KODE_GENRE INT);''')

cursor.close()

### **Insert Record**
Pada tahap ini, akan dimasukkan data dummy ke dalam tabel-tabel yang telah dibuat pada tahap sebelumnya.

In [25]:
#INSERT RECORD KE TABEL

#TABLE PELANGGAN 

MyDB = sqlite3.connect('bioskop1.sqlite')
cursor = MyDB.cursor()
cursor.execute("""INSERT OR IGNORE INTO PELANGGAN (ID_PELANGGAN, NAMA, JENIS_KELAMIN, ALAMAT, NO_HP, EMAIL) \
      VALUES 
      (1231, 'Fara', 'Perempuan', 'jalan kenangan no 1', 62234567890, 'fara@gmail.com'),
      (1232, 'Aurel', 'Perempuan', 'jalan kebajikan no 21', 62234557878 , 'aurel@gmail.com'),
      (1233, 'Natania', 'Perempuan', 'jalan angkasa no 3', 62278567890 , 'natania@gmail.com'),
      (1234, 'Yovela', 'Perempuan', 'jalan kebenaran no 8', 62250567857 , 'yovela@gmail.com'),
      (1235, 'Najwa', 'Perempuan', 'jalan pelita no 89', 62234567376 , 'najwa@gmail.com'),
      (1236, 'Fairuz', 'Perempuan', 'jalan melati no 90', 62234467579 , 'fairuz@gmail.com'),
      (1237, 'Nathan', 'Laki-Laki', 'jalan anggrek no 91', 62234237856 , 'nathan@gmail.com'),
      (1238, 'Raistro', 'Laki-Laki', 'jalan mawar no 92', 62124526890 , 'raistro@gmail.com'),
      (1239, 'Natalia', 'Perempuan', 'jalan kamboja no 93', 62124477284 , 'natalia@gmail.com'),
      (1240, 'Mufidah', 'Perempuan', 'jalan tulip no 94', 62134526482 , 'mufidah@gmail.com')""");
                           
MyDB.commit()
MyDB.close()


#TABLE PEMESANAN
MyDB = sqlite3.connect('bioskop1.sqlite')
cursor = MyDB.cursor()
cursor.execute("""INSERT INTO PEMESANAN (ID_PEMESANAN, JUMLAH_TIKET, TOTAL_HARGA, TANGGAL_PEMESANAN, ID_TIKET, ID_PELANGGAN)\
      VALUES 
      (453, 1, 85000, '16-05-2022', 17055, 1231),
      (454, 2, 100000, '17-05-2022', 18442, 1232),
      (455, 1, 50000, '17-05-2022', 20730, 1233),
      (459, 1, 85000, '18-05-2022', 85167, 1234),
      (460, 1, 50000, '18-05-2022', 27281, 1235),
      (461, 3, 150000, '19-05-2022', 32580, 1236),
      (462, 2, 150000, '19-05-2022', 24803, 1237),
      (463, 1, 75000, '19-05-2022', 73493, 1238),  
      (464, 5, 300000, '20-05-2022', 37425, 1239),
      (465, 1, 60000, '20-05-2022', 73244, 1240)""");
                           
MyDB.commit()
MyDB.close()

#TABLE STUDIO
MyDB = sqlite3.connect('bioskop1.sqlite')
cursor = MyDB.cursor()
cursor.execute("""INSERT OR IGNORE INTO STUDIO (KODE_STUDIO, NAMA_STUDIO, KODE_FILM) \
      VALUES 
      (171, 1, 'KKN'),
      (183, 2, 'DRS'),
      (171, 1, 'KKN'),
      (183, 2, 'DRS'),
      (215, 3, 'FST'),
      (215, 3, 'KKN'),
      (171, 1, 'DRS'),
      (215, 3, 'KKN'),
      (215, 3, 'KKN'),
      (215, 3, 'KKN')""");

MyDB.commit()
MyDB.close()

#TABLE JADWAL
MyDB = sqlite3.connect('bioskop1.sqlite')
cursor = MyDB.cursor()
cursor.execute("""INSERT OR IGNORE INTO JADWAL (ID_JADWAL, TANGGAL, JAM_MULAI, JAM_SELESAI) \
      VALUES 
      (171921, '17-05-2022', '19:00', '21:00'),
      (171315, '17-05-2022', '13:30', '15:30'),
      (181921, '18-05-2022', '13:30', '15:30'),
      (181517, '18-05-2022', '15:00', '17:00'),
      (181719, '18-05-2022', '17:00', '19:00'),
      (211719, '21-05-2022', '17:00', '19:00'),
      (211315, '21-05-2022', '13:30', '15:30'),
      (211012, '21-05-2022', '10:00', '12:00'),
      (211316, '21-05-2022', '13:00', '15:00'),
      (212022, '21-05-2022', '20:00', '22:00')""");

MyDB.commit()
MyDB.close()



#TABLE TIKET 
MyDB = sqlite3.connect('bioskop1.sqlite')
cursor = MyDB.cursor()
cursor.execute("""INSERT INTO TIKET (ID_TIKET, HARGA, ID_JADWAL, KODE_FILM, NAMA_KURSI) \
      VALUES 
      (17055, 85000, 171921, 'KKN', 'A5'),
      (18442, 50000, 171315, 'DRS', 'C6,C7'),
      (20730, 50000, 181921, 'KKN', 'A6'),
      (85167, 85000, 181517, 'DRS', 'D3'),
      (27281, 50000, 181719, 'FST', 'C8'),
      (32580, 50000, 211719, 'KKN', 'G10,G11,G12'),
      (24803, 75000, 211315, 'DRS', 'J5,J6'),
      (73493, 75000, 211012, 'KKN', 'F7'),
      (37425, 60000, 211316, 'KKN', 'H3,H4,H5,H6,H7'),
      (73244, 60000, 212022, 'KKN', 'H8')""");

MyDB.commit()
MyDB.close()




#TABLE KURSI
MyDB = sqlite3.connect('bioskop1.sqlite')
cursor = MyDB.cursor()
cursor.execute("""INSERT INTO KURSI (NAMA_KURSI, KODE_STUDIO) \
      VALUES 
      ('A5', '171'),
      ('C6,C7', '183'),
      ('A6', '171'),
      ('D3', '183'),
      ('C8', '215'),
      ('G10,G11,G12', '215'),
      ('J5,J6', '171'),
      ('F7', '215'),  
      ('H3,H4,H5,H6,H7', '215'),
      ('H8', '215')""");

MyDB.commit()
MyDB.close()



#TABLE GENRE
MyDB = sqlite3.connect('bioskop1.sqlite')
cursor = MyDB.cursor()
cursor.execute("""INSERT INTO GENRE (KODE_GENRE, NAMA_GENRE) \
      VALUES 
      ('H', 'horror'),
      ('S', 'science fiction'),
      ('T', 'thriller')""");

MyDB.commit()
MyDB.close()



#TABLE FILM
MyDB = sqlite3.connect('bioskop1.sqlite')
cursor = MyDB.cursor()
cursor.execute("""INSERT INTO FILM (KODE_FILM, JUDUL, KODE_GENRE) \
      VALUES 
      ('KKN', 'KKN di DESA PENARI', 'H'),
      ('DRS', 'DR. STRANGE', 'S'),
      ('FST', 'FIRE STARTER', 'T')""");

MyDB.commit()
MyDB.close()

### **Insert New Record**
Berikut  adalah code yang digunakan untuk menambahkan record baru pada table.

In [26]:
#INSERT RECORD BARU

MyDB = sqlite3.connect('bioskop1.sqlite')
cursor = MyDB.cursor()
cursor.execute("""INSERT OR IGNORE INTO PELANGGAN (ID_PELANGGAN, NAMA, JENIS_KELAMIN, ALAMAT, NO_HP, EMAIL) \
      VALUES 
      (1241, 'Dora', 'Perempuan', 'jalan kenangan no 12', 62232665893, 'dora@gmail.com'),
      (1242, 'Patrick', 'Laki-Laki', 'jalan tulip no 95', 62154726467 , 'patrick@gmail.com')""");
            
               
MyDB.commit()
MyDB.close()

### **Update Record**
Berikut adalah code yang digunakan untuk memperbaharui record pada table.

In [31]:
#UPDATE RECORD
MyDB = sqlite3.connect('bioskop1.sqlite')
cursor = MyDB.cursor()
cursor.execute("UPDATE PELANGGAN SET NAMA='Patrik' WHERE ID_PELANGGAN = 1242");
MyDB.commit()
MyDB.close()

Misalkan terdapat kesalahan input nama pada pelanggan bernama Patrick dengan ID_PELANGGAN 1242. Maka dengan code tersebut, nama yang awalnya Patrick akan berubah menjadi Patrik.

### **Delete Record**
Berikut adalah code yang digunakan untuk menghapus record pada table.

In [32]:
#DELETE RECORD

MyDB = sqlite3.connect('bioskop1.sqlite')
cursor = MyDB.cursor()
cursor.execute("DELETE FROM PELANGGAN WHERE ID_PELANGGAN = 1241");
MyDB.commit()
MyDB.close()

Pada tahap ini, dilakukan penghapusan salah satu record dari table PELANGGAN. Akan dihapus pelanggan yang memiliki ID PELANGGAN 1241. Setelah code tersebut di-run maka pelanggan yang memiliki id pelanggan 1241 akan terhapus dari table.

### **Select**
Pada tahap ini, misalkan ingin melihat semua isi data (record) dari tabel PELANGGAN, maka dapat dilakukan dengan menggunakan syntax

    cursor.execute(“SELECT * FROM (nama tabel)”)

Simbol (*) di sini berarti mengambil semua data tanpa terkecuali. 

Kemudian menggunakan syntax 

    fetchall() 

untuk menampilkan semua datanya dan data disimpan dalam storage. Menggunakan sedikit looping agar data terlihat rapi.

In [39]:
#SELECT
MyDB = sqlite3.connect('bioskop1.sqlite')
cursor = MyDB.cursor()
cursor.execute("SELECT * FROM PELANGGAN")
cust=cursor.fetchall()
for customer in cust:
    print(customer)
MyDB.commit()
MyDB.close()

(1231, 'Fara', 'Perempuan', 'jalan kenangan no 1', 62234567890, 'fara@gmail.com')
(1232, 'Aurel', 'Perempuan', 'jalan kebajikan no 21', 62234557878, 'aurel@gmail.com')
(1233, 'Natania', 'Perempuan', 'jalan angkasa no 3', 62278567890, 'natania@gmail.com')
(1234, 'Yovela', 'Perempuan', 'jalan kebenaran no 8', 62250567857, 'yovela@gmail.com')
(1235, 'Najwa', 'Perempuan', 'jalan pelita no 89', 62234567376, 'najwa@gmail.com')
(1236, 'Fairuz', 'Perempuan', 'jalan melati no 90', 62234467579, 'fairuz@gmail.com')
(1237, 'Nathan', 'Laki-Laki', 'jalan anggrek no 91', 62234237856, 'nathan@gmail.com')
(1238, 'Raistro', 'Laki-Laki', 'jalan mawar no 92', 62124526890, 'raistro@gmail.com')
(1239, 'Natalia', 'Perempuan', 'jalan kamboja no 93', 62124477284, 'natalia@gmail.com')
(1240, 'Mufidah', 'Perempuan', 'jalan tulip no 94', 62134526482, 'mufidah@gmail.com')
(1242, 'Patrik', 'Laki-Laki', 'jalan tulip no 95', 62154726467, 'patrick@gmail.com')

Misalkan pula, ingin diketahui apa saja judul film yang diputar di bioskop dengan asumsi hanya ada tiga film yang diputar. Maka, hal itu dapat dilakukan dengan syntax

    cursor.execute(“SELECT (atribut yang diinginkan)  FROM (tabel yang berisikan atribut tersebut))

Dengan menggunakan 

    fetchall() 

untuk menampilkan semua record dan menyimpan dalam storage, maka dihasilkan output sebagai berikut.

In [33]:
MyDB = sqlite3.connect('bioskop1.sqlite')
cursor = MyDB.cursor()
cursor.execute("SELECT JUDUL FROM FILM")
titles=cursor.fetchall()
for title in titles:
    print(title)
MyDB.commit()
MyDB.close()

('KKN di DESA PENARI',)
('DR. STRANGE',)
('FIRE STARTER',)

### **Count**

In [37]:
#COUNTING

#COUNTING THE AMOUNT OF MOVIES
MyDB = sqlite3.connect('bioskop1.sqlite')
cursor = MyDB.cursor()
cursor.execute("SELECT COUNT(KODE_FILM) FROM TIKET WHERE KODE_FILM = 'DRS'")
films=cursor.fetchall()
films

[(3,)]

In [38]:
#COUNTING TANGGAL
cursor.execute("SELECT TANGGAL, COUNT(TANGGAL) FROM JADWAL GROUP BY TANGGAL ")
tanggal=cursor.fetchall()
tanggal

[('17-05-2022', 2), ('18-05-2022', 3), ('21-05-2022', 5)]

Dapat terlihat dari hasil count bahwa penonton paling banyak hadir pada saat weekend (Sabtu, 21 Mei 2022), yaitu empat penonton. Sementara itu, terdapat dua penonton pada hari Selasa, 17 Mei 2022 dan tiga penonton pada hari Rabu, 18 Mei 2022

### **Join**
Misalkan ingin dilihat masing-masing pelanggan telah membeli berapa tiket bioskop, maka akan digabungkan dua tabel (tabel PELANGGAN dan tabel PEMESANAN) dengan menggunakan code berikut

In [40]:
#JOIN
MyDB = sqlite3.connect('bioskop1.sqlite')
cursor = MyDB.cursor()
cursor.execute("SELECT PELANGGAN.NAMA, PEMESANAN.JUMLAH_TIKET FROM PELANGGAN JOIN PEMESANAN ON PELANGGAN.ID_PELANGGAN=PEMESANAN.ID_PELANGGAN")
cust=cursor.fetchall()
for customer in cust:
    print(customer)
MyDB.commit()
MyDB.close()

('Fara', 1)
('Aurel', 2)
('Natania', 1)
('Yovela', 1)
('Najwa', 1)
('Fairuz', 3)
('Nathan', 2)
('Raistro', 1)
('Natalia', 5)
('Mufidah', 1)

Selain menggunakan fungsi **JOIN**, **ON** untuk menggabungkan beberapa tabel, kita dapat juga menggunakan fungsi **WHERE**, **AND** misalnya untuk melihat harga yang dibayar, genre dan film yang ditonton masing-masing pelanggan

In [41]:
MyDB = sqlite3.connect('bioskop1.sqlite')
cursor = MyDB.cursor()
cursor.execute("SELECT NAMA, JUMLAH_TIKET, HARGA, JUDUL, NAMA_GENRE FROM PELANGGAN, PEMESANAN, TIKET, FILM, GENRE WHERE PELANGGAN.ID_PELANGGAN = PEMESANAN.ID_PELANGGAN AND PEMESANAN.ID_TIKET = TIKET.ID_TIKET AND TIKET.KODE_FILM = FILM.KODE_FILM AND FILM.KODE_GENRE = GENRE.KODE_GENRE")
cust=cursor.fetchall()
for customer in cust:
    print(customer)
MyDB.commit()
MyDB.close()

('Fara', 1, 85000.0, 'KKN di DESA PENARI', 'horror')
('Aurel', 2, 50000.0, 'DR. STRANGE', 'science fiction')
('Natania', 1, 50000.0, 'KKN di DESA PENARI', 'horror')
('Yovela', 1, 85000.0, 'DR. STRANGE', 'science fiction')
('Najwa', 1, 50000.0, 'FIRE STARTER', 'thriller')
('Fairuz', 3, 50000.0, 'KKN di DESA PENARI', 'horror')
('Nathan', 2, 75000.0, 'DR. STRANGE', 'science fiction')
('Raistro', 1, 75000.0, 'KKN di DESA PENARI', 'horror')
('Natalia', 5, 60000.0, 'KKN di DESA PENARI', 'horror')
('Mufidah', 1, 60000.0, 'KKN di DESA PENARI', 'horror')